W6D4/routing_controllers/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "view_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 9], ["view_id", 13]]
---
  def create
    artwork_share = ArtworkShare.new(artwork_share_params)

    if artwork_share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 11]]
---
  def destroy
    artwork_share = ArtworkShare.find(params[:id])
    if artwork_share.destroy