W6D4/routing_controllers/app/controllers/collections_controller.rb

  def index
    if params[:user_id]
      user = User.find(params[:user_id])
      result = user.collections
    elsif params[:artwork_id ]
      artwork = Artwork.find(params[:artwork_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]

  def show
    collection = Collection.find(params[:id]).artworks
---
SELECT "artworks".* FROM "artworks" INNER JOIN "collection_records" ON "artworks"."id" = "collection_records"."artwork_id" WHERE "collection_records"."collection_id" = $1  [["collection_id", 7]]
SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]