W6D4/routing_controllers/app/controllers/comments_controller.rb

  def index

    if params[:user_id]
      user = User.find(params[:user_id])
      result = user.comments
    elsif params[:artwork_id]
      artwork = Artwork.find(params[:artwork_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]

  def create
    comment = Comment.new(comment_params)

    if comment.save
---
INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 14], ["artwork_id", 12], ["body", "fascinating"], ["created_at", "2020-01-23 00:54:19.294624"], ["updated_at", "2020-01-23 00:54:19.294624"]]