W6D4/routing_controllers/app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 26]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def index
    if params[:user_id]
      result = User.find(params[:user_id]).likes
    elsif params[:artwork_id]
      result = Artwork.find(params[:artwork_id]).likes
    elsif params[:comment_id]
      result = Comment.find(params[:comment_id]).likes