W6D4/routing_controllers/app/controllers/users_controller.rb

  def index
    if params[:username]
      user = User.find_by(username: params[:username])
      render json: user
    else
      users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "africalochsa"], ["LIMIT", 1]]
SELECT "users".* FROM "users"

  def create
    user = User.new(user_params)

    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "apple"], ["email", "apple@app.com"], ["created_at", "2020-01-22 22:19:48.930559"], ["updated_at", "2020-01-22 22:19:48.930559"]]

  def update
    user = User.find(params[:id])
    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "peach"], ["email", "peach@app.com"], ["updated_at", "2020-01-22 22:29:30.302726"], ["id", 5]]

  def destroy
    user = User.find(params[:id])
    if user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]

  def favorites
    user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]