W8D1/reddit/app/controllers/comments_controller.rb

    def create
        @comment = Comment.new(
            content: params[:comment][:content],
            post_id: params[:comment][:post_id],
            parent_comment_id: params[:comment][:parent_comment_id],
            author_id: current_user.id
            )
        # debugger
        if @comment.save
---
INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at", "parent_comment_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "ok"], ["author_id", 1], ["post_id", 11], ["created_at", "2020-02-04 01:19:36.061531"], ["updated_at", "2020-02-04 01:19:36.061531"], ["parent_comment_id", 4]]

    def show
        @comment = Comment.find_by(id: params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]