W8D1/reddit/app/controllers/posts_controller.rb

SELECT "subs".* FROM "subs"
---
    def new
        @post = Post.new
        @subs = Sub.all

SELECT "subs".* FROM "subs"
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "asdads"], ["url", ""], ["content", "test"], ["author_id", 1], ["created_at", "2020-02-03 23:00:19.333895"], ["updated_at", "2020-02-03 23:00:19.333895"]]
---
    def create
        # debugger
        # ids = params[:post][:sub_ids]
        # ids.map! { |id| id.to_i }
        # debugger
        @post = Post.new(post_params)
        # content = params[:post][:content].strip
        # @post.content = content
        @post.author_id = current_user.id
        @subs = Sub.all

        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "subs".* FROM "subs"
---
    def edit
        @post = Post.find_by(id: params[:id])
        @subs = Sub.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "D:\r\n        \r\n        "], ["updated_at", "2020-02-03 23:35:41.694306"], ["id", 11]]
---
    def update
        @post = Post.find_by(id: params[:id])
        if @post && @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 8]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @post = Post.find_by(id: params[:id])
        @all_comments = @post.comments.includes(:author)
        if @post
            @author = User.find_by(id: @post.author_id)