W8D1/reddit/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "AskAppAcademy"], ["description", "Ask Questions About App Academy!"], ["moderator_id", 1], ["created_at", "2020-02-03 19:34:38.054185"], ["updated_at", "2020-02-03 19:34:38.054185"]]
---
    def create
        @sub = Sub.new(sub_params)
        @sub.moderator_id = current_user.id
        if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @sub = Sub.find_by(id: params[:id])

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "who is this"], ["updated_at", "2020-02-03 19:43:04.989888"], ["id", 1]]
---
    def update
        @sub = Sub.find_by(id: params[:id])

        if @sub && @sub.update(sub_params)

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @sub = Sub.find_by(id: params[:id])