W8D1/reddit/app/views/posts/edit.html.erb

        <label>
            <input type="checkbox" name="post[sub_ids][]" value="<%= sub.id %>" <%= @post.subs.include?(sub) ? "checked" : "" %>>
---
SELECT "subs".* FROM "subs"
SELECT  1 AS one FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1 AND "subs"."id" = $2 LIMIT $3  [["post_id", 11], ["id", 1], ["LIMIT", 1]]