W6D5/cats/app/models/cat_rental_request.rb

SELECT  1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 AND ('1520-12-20' <= end_date AND '1521-12-21' >= start_date) LIMIT $2  [["cat_id", 3], ["LIMIT", 1]]
---
  def overlapping_request
    # rental = CatRentalRequest.where(cat_id: self.cat_id).
    rental = CatRentalRequest.where(cat_id: self.cat_id).where('? <= end_date AND ? >= start_date', self.start_date, self.end_date).where(status: "APPROVED")
    errors[:cat_id] << "Already rented" unless rental.empty?