W6D3/routing_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    # if params[:query]
      # render json: params
    # end
    users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "peach"], ["email", "peach@app.com"], ["updated_at", "2020-01-22 22:29:30.302726"], ["id", 5]]
---
  def update
    user = User.find(params[:id])
    if user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
---
  def destroy
    user = User.find(params[:id])
    if user.destroy