W7D2/music/app/models/user.rb

  def reset_session_token!
    self.session_token = User.generate_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "UdcwIdkmtbUJi_g_xwf-TA"], ["updated_at", "2020-01-31 00:58:42.463351"], ["id", 1]]