W7D2/music/app/controllers/bands_controller.rb

  def create
    band = Band.new(band_params)
    if band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "banana"], ["created_at", "2020-01-30 04:49:15.264281"], ["updated_at", "2020-01-30 04:49:15.264281"]]

  def update
    @band = Band.find(params[:id])
    if @band && @band.update_attributes(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "cat"], ["updated_at", "2020-01-30 04:53:35.746568"], ["id", 1]]

  def destroy
    band = Band.find(params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def index
    @bands = Band.all
---
SELECT "bands".* FROM "bands"