W6D5/cats/app/controllers/cat_rental_requests_controller.rb

SELECT "cats".* FROM "cats"
---
  def new
    @crr = CatRentalRequest.new
    @cats = Cat.all

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 3], ["start_date", "1520-12-20"], ["end_date", "1521-12-21"], ["status", "PENDING"], ["created_at", "2020-01-25 00:32:18.174790"], ["updated_at", "2020-01-25 00:32:18.174790"]]
---
  def create
    @crr = [CatRentalRequest.new(crr_params)]
    if @crr.first.save