W8D1/reddit/app/models/post.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
    def comments_by_parent_id
        hash = Hash.new { |h,k| h[k] = [] }

        self.comments.each do | comment |